{
  "vacancies": [
    {
      "id": 1,
      "title": "Software Engineer",
      "category": "IT",
      "company": "TechCorp",
      "salary": "2000 - 3000 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": false,
      "description": "TechCorp is looking for a skilled Software Engineer to join their development team. You will be responsible for designing, coding, and testing software applications. The role requires collaboration with other IT professionals to deliver high-quality solutions. Candidates should have at least 2 years of experience in software development. This position offers opportunities for career growth and skill development in a dynamic environment."
    },
    {
      "id": 2,
      "title": "UI/UX Designer",
      "category": "Design",
      "company": "CreativeStudio",
      "salary": "1500 - 2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "CreativeStudio is seeking a talented UI/UX Designer to create visually appealing and user-friendly interfaces. You will collaborate closely with developers and product managers to enhance the user experience. The candidate should have a strong portfolio demonstrating previous design projects. This role requires creativity, attention to detail, and a good understanding of design principles. Experience of at least 3 years in UI/UX design is required."
    },
    {
      "id": 3,
      "title": "Accountant",
      "category": "Finance",
      "company": "FinancePlus",
      "salary": "1000 - 1500 AZN",
      "city": "Ganja",
      "education": "Bakalavr",
      "experience": "4 il",
      "premium": false,
      "description": "FinancePlus is hiring an Accountant to manage financial transactions and maintain accurate records. The position involves preparing reports, budgets, and ensuring compliance with regulations. Candidates should be detail-oriented and have a strong understanding of accounting principles. Experience in financial analysis and reporting is highly valued. This is an excellent opportunity for professionals with at least 4 years of accounting experience to grow their career."
    },
    {
      "id": 4,
      "title": "HR Specialist",
      "category": "Human Resources",
      "company": "PeopleFirst",
      "salary": "1200 - 1800 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "PeopleFirst is seeking an HR Specialist to manage recruitment, employee relations, and HR operations. The role requires effective communication skills and the ability to handle confidential information. You will participate in policy development and training initiatives. Candidates should have at least 3 years of experience in HR or related fields. This role provides a chance to work in a dynamic environment and develop professionally."
    },
    {
      "id": 5,
      "title": "Marketing Manager",
      "category": "Marketing",
      "company": "BrandBoost",
      "salary": "1800 - 2500 AZN",
      "city": "Sumqayit",
      "education": "Bakalavr",
      "experience": "5 il",
      "premium": false,
      "description": "BrandBoost is hiring a Marketing Manager to lead marketing campaigns and brand strategies. You will coordinate with creative teams to implement promotional initiatives. The candidate should have strong analytical skills and experience in marketing planning. This position requires at least 5 years of experience in marketing or management roles. The role offers opportunities to influence company growth and enhance brand visibility."
    },
    {
      "id": 6,
      "title": "Sales Executive",
      "category": "Sales",
      "company": "SalesForce",
      "salary": "1000 - 2000 AZN",
      "city": "Baku",
      "education": "Orta",
      "experience": "2 il",
      "premium": true,
      "description": "SalesForce is looking for a Sales Executive to develop client relationships and increase sales revenue. The role involves generating leads, negotiating deals, and meeting targets. Candidates should have excellent communication and interpersonal skills. Experience of at least 2 years in sales is preferred. This is a dynamic position offering growth opportunities in a competitive market."
    },
    {
      "id": 7,
      "title": "Project Manager",
      "category": "Management",
      "company": "ProManage",
      "salary": "2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "5 il",
      "premium": false,
      "description": "ProManage is hiring a Project Manager to oversee projects from initiation to completion. You will manage timelines, resources, and ensure project objectives are met. Candidates should have excellent leadership and organizational skills. A minimum of 5 years experience in project management is required. This role offers the opportunity to work with diverse teams and drive successful project outcomes."
    },
    {
      "id": 8,
      "title": "Business Analyst",
      "category": "IT",
      "company": "BizTech",
      "salary": "2000 - 2800 AZN",
      "city": "Ganja",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "BizTech is seeking a Business Analyst to assess business processes and provide strategic recommendations. You will work closely with IT and management teams to improve efficiency. Candidates should have strong analytical and problem-solving skills. Minimum 3 years of experience in business analysis or related fields is required. This position provides exposure to various projects and career advancement opportunities."
    },
    {
      "id": 9,
      "title": "Content Writer",
      "category": "Marketing",
      "company": "WriteWell",
      "salary": "1000 - 1500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": false,
      "description": "WriteWell is looking for a Content Writer to produce engaging and high-quality content. You will be responsible for blog posts, articles, and digital marketing materials. Candidates should have strong writing and research skills. Experience of at least 2 years in content creation is preferred. This role allows creativity and the opportunity to contribute to the company's marketing strategy."
    },
    {
      "id": 10,
      "title": "Frontend Developer",
      "category": "IT",
      "company": "CodeMasters",
      "salary": "1800 - 2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "CodeMasters is hiring a Frontend Developer to build responsive web applications. You will collaborate with designers and backend developers to implement interactive features. Strong knowledge of modern JavaScript frameworks is required. Candidates should have at least 3 years of frontend development experience. This role offers the opportunity to work on challenging projects and grow technical skills."
    },
    {
      "id": 11,
      "title": "Backend Developer",
      "category": "IT",
      "company": "CodeMasters",
      "salary": "2000 - 3000 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": false,
      "description": "CodeMasters seeks a Backend Developer to design and maintain server-side applications. Responsibilities include database management and API development. Candidates must have at least 3 years of experience in backend technologies. Strong problem-solving and coding skills are essential. The role provides a collaborative environment for professional growth."
    },
    {
      "id": 12,
      "title": "Graphic Designer",
      "category": "Design",
      "company": "DesignHub",
      "salary": "1300 - 2000 AZN",
      "city": "Sumqayit",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": true,
      "description": "DesignHub is hiring a Graphic Designer to create visual concepts for marketing and branding. You will work on digital and print materials to convey messages effectively. Candidates should have strong creativity and proficiency in design software. Minimum 2 years of experience is required. This position allows for artistic growth and collaboration with creative teams."
    },
    {
      "id": 13,
      "title": "Customer Support",
      "category": "Support",
      "company": "HelpLine",
      "salary": "800 - 1200 AZN",
      "city": "Baku",
      "education": "Orta",
      "experience": "1 il",
      "premium": false,
      "description": "HelpLine is looking for a Customer Support representative to assist clients with inquiries and issues. The role requires patience, communication skills, and problem-solving abilities. Candidates should have at least 1 year of experience in customer service. This position offers training and career growth opportunities. A positive attitude and teamwork are essential for success."
    },
    {
      "id": 14,
      "title": "IT Support Specialist",
      "category": "IT",
      "company": "TechHelp",
      "salary": "1000 - 1500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": true,
      "description": "TechHelp is seeking an IT Support Specialist to provide technical assistance to clients and staff. Responsibilities include troubleshooting hardware and software issues. Candidates should have at least 2 years of IT support experience. Strong problem-solving skills and customer service orientation are required. This role offers opportunities to enhance technical knowledge and support diverse IT systems."
    },
    {
      "id": 15,
      "title": "Office Manager",
      "category": "Management",
      "company": "OfficeWorks",
      "salary": "1200 - 1800 AZN",
      "city": "Ganja",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": false,
      "description": "OfficeWorks is hiring an Office Manager to oversee daily administrative operations. Responsibilities include managing staff, office supplies, and internal processes. Candidates should have at least 3 years of experience in office management. Strong organizational and communication skills are essential. The position offers an opportunity to improve office efficiency and leadership skills."
    },
    {
      "id": 16,
      "title": "Data Analyst",
      "category": "IT",
      "company": "DataCorp",
      "salary": "2000 - 2700 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "DataCorp is looking for a Data Analyst to collect, analyze, and interpret data to support business decisions. You will work with large datasets and reporting tools. Candidates should have strong analytical skills and at least 3 years of experience. Knowledge of SQL, Excel, and visualization tools is required. This role provides opportunities to influence company strategies using data insights."
    },
    {
      "id": 17,
      "title": "Social Media Manager",
      "category": "Marketing",
      "company": "SocialBoost",
      "salary": "1500 - 2200 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": false,
      "description": "SocialBoost is seeking a Social Media Manager to manage and grow social media platforms. Responsibilities include content creation, engagement, and analytics. Candidates should have at least 2 years of experience in social media management. Strong communication and creative skills are essential. This role allows for shaping the brand's online presence and campaigns."
    },
    {
      "id": 18,
      "title": "QA Engineer",
      "category": "IT",
      "company": "QualitySoft",
      "salary": "1800 - 2400 AZN",
      "city": "Sumqayit",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "QualitySoft is hiring a QA Engineer to test software products and ensure quality standards. Responsibilities include creating test plans, identifying bugs, and collaborating with developers. Candidates should have at least 3 years of QA experience. Attention to detail and analytical skills are crucial. This role offers the opportunity to work on diverse projects and improve software reliability."
    },
    {
      "id": 19,
      "title": "Network Administrator",
      "category": "IT",
      "company": "NetSecure",
      "salary": "2000 - 2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "4 il",
      "premium": false,
      "description": "NetSecure is looking for a Network Administrator to manage and maintain network systems. Responsibilities include troubleshooting, monitoring, and implementing network solutions. Candidates should have at least 4 years of networking experience. Strong knowledge of network protocols and security practices is required. This role provides opportunities to ensure smooth network operations in a growing company."
    },
    {
      "id": 20,
      "title": "Recruiter",
      "category": "Human Resources",
      "company": "TalentPro",
      "salary": "1200 - 1800 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": true,
      "description": "TalentPro is seeking a Recruiter to attract and hire top talent. You will manage the recruitment process, including interviews and candidate assessment. Candidates should have at least 2 years of recruitment experience. Strong interpersonal and communication skills are essential. This position allows you to shape the company's workforce and contribute to HR strategies."
    },
    {
      "id": 21,
      "title": "Operations Manager",
      "category": "Management",
      "company": "OpsWorld",
      "salary": "2500 - 3500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "5 il",
      "premium": false,
      "description": "OpsWorld is hiring an Operations Manager to oversee daily operations and optimize processes. You will lead teams and implement operational strategies. Candidates should have at least 5 years of management experience. Strong leadership and problem-solving skills are required. This role offers opportunities to impact company efficiency and growth."
    },
    {
      "id": 22,
      "title": "Technical Writer",
      "category": "IT",
      "company": "TechDocs",
      "salary": "1500 - 2000 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": true,
      "description": "TechDocs is seeking a Technical Writer to create manuals, guides, and documentation for software products. The role requires clear writing and understanding of technical concepts. Candidates should have at least 2 years of experience in technical writing. Attention to detail and communication skills are essential. This position allows you to contribute to product clarity and user understanding."
    },
    {
      "id": 23,
      "title": "Product Manager",
      "category": "Management",
      "company": "ProdManage",
      "salary": "2500 - 3500 AZN",
      "city": "Ganja",
      "education": "Bakalavr",
      "experience": "4 il",
      "premium": false,
      "description": "ProdManage is hiring a Product Manager to lead product development from concept to launch. Responsibilities include market analysis, planning, and coordination with teams. Candidates should have at least 4 years of product management experience. Strong organizational and strategic thinking skills are required. This role provides an opportunity to drive product success and business growth."
    },
    {
      "id": 24,
      "title": "Finance Analyst",
      "category": "Finance",
      "company": "MoneyTrack",
      "salary": "2000 - 2700 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "MoneyTrack is seeking a Finance Analyst to analyze financial data and provide actionable insights. The role involves budgeting, forecasting, and reporting. Candidates should have at least 3 years of experience in finance or analysis. Strong analytical and quantitative skills are essential. This position offers exposure to key financial decisions and strategic planning."
    },
    {
      "id": 25,
      "title": "Legal Advisor",
      "category": "Law",
      "company": "LawFirm",
      "salary": "1800 - 2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "4 il",
      "premium": false,
      "description": "LawFirm is hiring a Legal Advisor to provide legal guidance and support. Responsibilities include contract review, compliance, and risk assessment. Candidates should have at least 4 years of experience in law or legal consulting. Strong analytical and communication skills are required. This role offers the opportunity to work on complex legal matters and advise senior management."
    },
    {
      "id": 26,
      "title": "Event Manager",
      "category": "Marketing",
      "company": "EventPro",
      "salary": "1500 - 2200 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "EventPro is looking for an Event Manager to plan and execute events from start to finish. Responsibilities include coordinating vendors, budgets, and schedules. Candidates should have at least 3 years of experience in event management. Strong organizational and communication skills are essential. This role provides the opportunity to create memorable experiences and grow professionally."
    },
    {
      "id": 27,
      "title": "SEO Specialist",
      "category": "Marketing",
      "company": "SearchMax",
      "salary": "1200 - 1800 AZN",
      "city": "Sumqayit",
      "education": "Bakalavr",
      "experience": "2 il",
      "premium": false,
      "description": "SearchMax is hiring an SEO Specialist to improve website visibility and search rankings. Responsibilities include keyword research, optimization, and reporting. Candidates should have at least 2 years of SEO experience. Strong analytical and technical skills are required. This position offers the opportunity to enhance digital presence and marketing impact."
    },
    {
      "id": 28,
      "title": "IT Project Coordinator",
      "category": "IT",
      "company": "TechProject",
      "salary": "2000 - 2700 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "TechProject is seeking an IT Project Coordinator to manage project schedules and resources. You will communicate between technical teams and management to ensure project success. Candidates should have at least 3 years of experience in project coordination. Strong organizational and multitasking skills are essential. This role offers exposure to diverse IT projects and professional growth opportunities."
    },
    {
      "id": 29,
      "title": "Customer Success Manager",
      "category": "Support",
      "company": "HappyClients",
      "salary": "1800 - 2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": false,
      "description": "HappyClients is hiring a Customer Success Manager to ensure clients achieve their goals. Responsibilities include onboarding, training, and support. Candidates should have at least 3 years of experience in customer success or account management. Strong communication and problem-solving skills are essential. This role provides the opportunity to enhance customer satisfaction and retention."
    },
    {
      "id": 30,
      "title": "Technical Support Engineer",
      "category": "IT",
      "company": "TechHelp",
      "salary": "1800 - 2500 AZN",
      "city": "Baku",
      "education": "Bakalavr",
      "experience": "3 il",
      "premium": true,
      "description": "TechHelp is looking for a Technical Support Engineer to provide technical assistance to clients and internal teams. Responsibilities include troubleshooting hardware and software issues and documenting solutions. Candidates should have at least 3 years of experience in technical support. Strong problem-solving, communication, and technical skills are required. This position offers opportunities to work on complex technical issues and develop professional expertise."
    }
  ]
}
